#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
微信配置模块
包含监听的群聊列表等配置信息
"""

# 定义需要监听的群聊列表（建筑相关群聊）
MONITORED_GROUPS = [
    # 原有的群
    "51844141003@chatroom",   # 建筑群-T-02283

    # 从 table.csv 添加的群聊列表
    "17563925751@chatroom",   # 工程人之建筑交流群1
    "24313676114@chatroom",   # 唯一只赚钱不花钱\ud83d\udc17
    "8379003914@chatroom",    # 资质收购转让
    "16111958471@chatroom",   # 建筑工程群聊\u00a5浙江省杭州市、
    "633496555@chatroom",     # 建筑收购资质转让\ud83c\udf88
    "22058441499@chatroom",   # 建筑工程有限公司有限公司
    "21690045470@chatroom",   # 院内各种同进群
    "7089598943@chatroom",    # 我有资质证群
    "23117854506@chatroom",   # 招聘专业
    "21499437449@chatroom",   # 建材实名验证进群
    "17789715779@chatroom",   # 建筑、证书交易\u2615\ufe0f
    "22972091216@chatroom",   # 浙江工程师咨询2群
    "18998927471@chatroom",   # 熊出没
    "9163077361@chatroom",    # 中日税和同信客户群
    "17325930636@chatroom",   # 上善若水 小窗户 4群
    "17858623435@chatroom",   # 有证招聘群
    "6299513782@chatroom",    # 工程精英群聊\u0026\ud83d\udc33
    "21608859124@chatroom",   # 兄弟收购群
    "56644391458@chatroom",   # 浙江资质转让群
    "17772117566@chatroom",   # 25岁为踏蹄工
    "5248371255@chatroom",    # 各种工程师证件交流群
    "21698086516@chatroom",   # 浙江工程师之高级群
    "20672578145@chatroom",   # 上善若水 小窗户 2群
    "7382729087@chatroom",    # 证件交流群321
    "25260198850@chatroom",   # 工程机械人工交流群
    "23964115883@chatroom",   # 建筑收购资质3群~
    "24975744068@chatroom",   # B浙江证书交流平台
    "22661185644@chatroom",   # 工程建筑精英群
    "24965083526@chatroom",   # \ud83c\udde8\ud83c\uddf3 全国资质 证3群
    "17525776062@chatroom",   # 行到云处-职场群
    "19552671550@chatroom",   # 浙江职称人员交流群
    "23074293804@chatroom",   # 工程建筑精英群
    "19074324796@chatroom",   # 浙江建工群联系微信（崔阳）
    "5289286663@chatroom",    # 证件，资质转让交流群
    "23965478692@chatroom",   # 收购资质群
    "21795692111@chatroom",   # 浙江同职工程群
    "19735381587@chatroom",   # 浙江同工小建筑交流群
    "9597161692@chatroom",    # 教师证书招聘
    "50591071296@chatroom",   # 零售证书群 欢迎讨论（添加T微信）
    "27052905926@chatroom",   # 全国资质收购群
    "4579336999@chatroom",    # C浙江建管1-中介服务群
    "17936906296@chatroom",   # 施工工程建筑资源
    "23656456137@chatroom",   # 浙江建筑资质收购群
    "21838726493@chatroom",   # 证书之同交流群总群
    "20884975852@chatroom",   # 总群 招聘同行
    "17257607130@chatroom",   # 江苏遍\ud83c\ude32省\ud83c\ude32群工聘
    "4930102981@chatroom",    # 浙江建筑企业平台
    "23608179663@chatroom",   # 证书招聘群
    "21799481749@chatroom",   # 浙江一级建筑人才交流群
    "5198262402@chatroom",    # \u26ea 工程建筑信息交流平台
    "21892991193@chatroom",   # 在京
    "24409272533@chatroom",   # 零售证书群(学生代理咨询群带)
    "22479909580@chatroom",   # \ud83c\udde8\ud83c\uddf3 全国资质 证1群
    "17944983510@chatroom",   # 资质证件交流群
    "24191467450@chatroom",   # 注册价考工程师
    "23851547037@chatroom",   # 河北招聘工程通浙江资质收购群
    "12312157712@chatroom"    # 企业交流群
]